testCases/2D_smoothTube/0/tube/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/tube";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 308.15;

boundaryField
{
    innerTube
    {
        type            externalWallHeatFluxTemperature;
        value           uniform 308.15;
        kappaMethod     solidThermo;
        kappaName       none;
        mode            flux;
        q               uniform -28000;
        K               basicThermo;
    }
    symmetry1
    {
        type            symmetryPlane;
    }
    symmetry2
    {
        type            symmetryPlane;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    tube_to_fluid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 308.15;
        Tnbr            T;
        kappaMethod     solidThermo;
        kappaName       none;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
