testCases/2D_smoothTube/constant/tube/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/tube/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    innerTube
    {
        type            wall;
        inGroups        1(wall);
        nFaces          332;
        startFace       1657;
    }
    symmetry1
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          3;
        startFace       1989;
    }
    symmetry2
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          3;
        startFace       1992;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          996;
        startFace       1995;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          996;
        startFace       2991;
    }
    tube_to_fluid
    {
        type            mappedWall;
        inGroups        
2
(
wall
mappedPatch
)
;
        nFaces          332;
        startFace       3987;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_tube;
    }
)

// ************************************************************************* //
