testCases/2D_smoothTube/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiRegionFoamCond1;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         20;

deltaT          1e-3;

writeControl    adjustableRunTime;
writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression on;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;


maxCo           0.01;
maxFo           11;
maxDi           10.0;
maxDeltaT	0.001;
adjustTimeStep  yes;

functions
{
	#include	"patchAverage"
}

// ************************************************************************* //
