testCases/2D_smoothTube/system/patchAverage
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the average value of one or more fields on a patch.

\*---------------------------------------------------------------------------*/
patchAverage
{
name    tube_to_fluid;
fields  ( T );
region	tube;

operation areaAverage;
#includeEtc "caseDicts/postProcessing/surfaceFieldValue/patch.cfg"
}
// ************************************************************************* //
